{
  "_links": {
    "html": {
      "href": "https://github.com/opensciencegrid/docs/pull/177#discussion_r139839519"
    }, 
    "pull_request": {
      "href": "https://api.github.com/repos/opensciencegrid/docs/pulls/177"
    }, 
    "self": {
      "href": "https://api.github.com/repos/opensciencegrid/docs/pulls/comments/139839519"
    }
  }, 
  "author_association": "OWNER", 
  "body": "Empty section. Remove?", 
  "commit_id": "4a4ed22fda9d855c25ca9e7918a7b800ba736a56", 
  "created_at": "2017-09-19T23:00:37Z", 
  "diff_hunk": "@@ -0,0 +1,980 @@\n+HTCondor-CE Troubleshooting Guide\n+=================================\n+\n+In this document, you will find a collection of files and commands to help troubleshoot HTCondor-CE along with a list of common issues with suggested troubleshooting steps.\n+\n+Known Issues\n+------------\n+\n+### SUBMIT\\_EXPRS are not applied to jobs on the local HTCondor ###\n+\n+If you are adding attributes to jobs submitted to your HTCondor pool with `SUBMIT_EXPRS`, these will *not* be applied to jobs that are entering your pool from the HTCondor-CE. To get around this, you will want to add the attributes to your [job routes](job-router-recipes). If the CE is the only entry point for jobs into your pool, you can get rid of `SUBMIT_EXPRS` on your backend. Otherwise, you will have to maintain your list of attributes both in your list of routes and in your `SUBMIT_EXPRS`.\n+\n+General Troubleshooting Items\n+-----------------------------\n+\n+### Making sure packages are up-to-date\n+\n+It is important to make sure that the HTCondor-CE and related RPMs are up-to-date.\n+\n+``` console\n+root@host # yum update \"htcondor-ce*\" blahp condor\n+```\n+\n+If you just want to see the packages to update, but do not want to perform the update now, answer `N` at the prompt.\n+\n+### Verify package contents\n+\n+If the contents of your HTCondor-CE packages have been changed, the CE may cease to function properly. To verify the contents of your packages (ignoring changes to configuration files):\n+\n+``` console\n+user@host $ rpm -q --verify htcondor-ce htcondor-ce-client blahp | awk '$2 != \"c\" {print $0}'\n+```\n+\n+If the verification command returns output, this means that your packages have been changed. To fix this, you can reinstall the packages:\n+\n+``` console\n+user@host $ yum reinstall htcondor-ce htcondor-ce-client blahp\n+```\n+\n+!!! note\n+    The reinstall command may place original versions of configuration files alongside the versions that you have modified. If this is the case, the reinstall command will notify you that the original versions will have an `.rpmnew` suffix. Further inspection of these files may be required as to whether or not you need to merge them into your current configuration.\n+\n+### Verify clocks are synchronized\n+\n+Like all GSI-based authentication, HTCondor-CE is sensitive to time skews. Make sure the clock on your CE is synchronized using a utility such as `ntpd`. Additionally, HTCondor itself is sensitive to time skews on the NFS server. If you see empty stdout / err being returned to the submitter, verify there is no NFS server time skew.\n+\n+HTCondor-CE Troubleshooting Items\n+---------------------------------\n+\n+This section contains common issues you may encounter using HTCondor-CE and next actions to take when you do. Before troubleshooting, we recommend increasing the log level:\n+\n+1.  Write the following into `/etc/condor-ce/config.d/99-local.conf` to increase the log level for all daemons:\n+\n+        ALL_DEBUG = D_FULLDEBUG\n+\n+2.  Ensure that the configuration is in place:\n+\n+        root@host # condor_ce_reconfig\n+\n+3.  Reproduce the issue\n+\n+!!! note\n+    Before spending any time on troubleshooting, you should ensure that the state of configuration is as expected by running [condor\\_ce\\_reconfig](#condor95ce95reconfig).\n+\n+### Daemons fail to start\n+\n+If there are errors in your configuration of HTCondor-CE, this may cause some of its required daemons to fail to startup. Check the following subsections in order:\n+\n+**Symptoms**\n+\n+Daemon startup failure may manifest in many ways, the following are few symptoms of the problem.\n+\n+-   The service fails to start:\n+\n+        :::console\n+        root@host # service condor-ce start\n+        Starting Condor-CE daemons: [ FAIL ]\n+\n+-   `condor_ce_q` fails with a lengthy error message:\n+\n+        :::console\n+        user@host $ condor_ce_q\n+        Error:\n+\n+        Extra Info: You probably saw this error because the condor_schedd is not running\n+        on the machine you are trying to query. If the condor_schedd is not running, the\n+        Condor system will not be able to find an address and port to connect to and\n+        satisfy this request. Please make sure the Condor daemons are running and try\n+        again.\n+\n+        Extra Info: If the condor_schedd is running on the machine you are trying to\n+        query and you still see the error, the most likely cause is that you have setup\n+        a personal Condor, you have not defined SCHEDD_NAME in your condor_config file,\n+        and something is wrong with your SCHEDD_ADDRESS_FILE setting. You must define\n+        either or both of those settings in your config file, or you must use the -name\n+        option to condor_q. Please see the Condor manual for details on SCHEDD_NAME and\n+        SCHEDD_ADDRESS_FILE.\n+\n+**Next actions**\n+\n+1.  **If the MasterLog is filled with `ERROR:SECMAN...TCP connection to collector...failed`:** This is likely due to a misconfiguration for a host with multiple network interfaces. Verify that you have followed the instructions in [this](install-htcondor-ce#networking) section of the install guide.\n+2.  **If the MasterLog is filled with `DC_AUTHENTICATE` errors:** The HTCondor-CE daemons use the host certificate to authenticate with each other. Verify that your host certificate’s DN matches one of the regular expressions found in `/etc/condor-ce/condor_mapfile`.\n+3.  **If the SchedLog is filled with `Can’t find address for negotiator`:** You can ignore this error! The negotiator daemon is used in HTCondor batch systems to match jobs with resources but since HTCondor-CE does not manage any resources directly, it does not run one.\n+\n+\n+### Jobs fail to submit to the CE\n+\n+If a user is having issues submitting jobs to the CE and you've ruled out general connectivity or firewalls as the culprit, then you may have encountered an authentication or authorization issue. You may see error messages like the following in your [SchedLog](#schedlog):\n+\n+```text\n+08/30/16 16:52:56 DC_AUTHENTICATE: required authentication of 72.33.0.189 failed: AUTHENTICATE:1003:Failed to authenticate with any method|AUTHENTICATE:1004:Failed to authenticate using GSI|GSI:5002:Failed to authenticate because the remote (client) side was not able to acquire its credentials.|AUTHENTICATE:1004:Failed to authenticate using FS|FS:1004:Unable to lstat(/tmp/FS_XXXZpUlYa)\n+08/30/16 16:53:12 PERMISSION DENIED to gsi@unmapped from host 72.33.0.189 for command 60021 (DC_NOP_WRITE), access level WRITE: reason: WRITE authorization policy contains no matching ALLOW entry for this request; identifiers used for this host: 72.33.0.189,dyn-72-33-0-189.uwnet.wisc.edu, hostname size = 1, original ip address = 72.33.0.189\n+08/30/16 16:53:12 DC_AUTHENTICATE: Command not authorized, done!\n+```\n+\n+**Next actions**\n+\n+1.  **Check GUMS or grid-mapfile** and ensure that the user's DN is known to your [authentication method](install-htcondor-ce#configuring-authentication)\n+2.  **Check for lcmaps errors** in `/var/log/messages`\n+3.  **If you do not see helpful error messages in `/var/log/messages`,** adjust the debug level by adding `export LCMAPS_DEBUG_LEVEL=5` to `/etc/sysconfig/condor-ce`, restarting the condor-ce service, and checking `/var/log/messages` for errors again.\n+\n+### Jobs stay idle on the CE\n+\n+Check the following subsections in order, but note that jobs may take several minutes or longer to run if the CE is busy.\n+\n+#### Idle jobs on CE: Is the job router handling the incoming job?\n+\n+Jobs on the CE will be put on hold if they do not match any job routes after 30 minutes, but you can check a few things if you suspect that the jobs are not being matched. Check if the JobRouter sees a job before that by looking at the [job router log](#jobrouterlog) and looking for the text `src=<JOB-ID>…claimed job`.\n+\n+**Next actions**\n+\n+Use [condor\\_ce\\_job\\_router\\_info](#condor95ce95job95router95info) to see why your idle job does not match any routes\n+\n+#### Idle jobs on CE: Verify correct operation between the CE and your local batch system\n+\n+##### For HTCondor batch systems\n+\n+HTCondor-CE submits jobs directly to an HTCondor batch system via the JobRouter, so any issues with the CE/local batch system interaction will appear in the [JobRouterLog](#jobrouterlog).\n+\n+**Next actions**\n+\n+1.  Check the [JobRouterLog](#jobrouterlog) for failures.\n+2.  Verify that the local HTCondor is functional.\n+3.  Use [condor\\_ce\\_config\\_val](#condor95ce95config95val) to verify that the `JOB_ROUTER_SCHEDD2_NAME`, `JOB_ROUTER_SCHEDD2_POOL`, and `JOB_ROUTER_SCHEDD2_SPOOL` configuration variables are set to the hostname of your CE, the hostname and port of your local HTCondor’s collector, and the location of your local HTCondor’s spool directory, respectively.\n+4.  Use `condor_config_val QUEUE_SUPER_USER_MAY_IMPERSONATE` and verify that it is set to `.*`.\n+\n+##### For non-HTCondor batch systems\n+\n+HTCondor-CE submits jobs to a non-HTCondor batch system via the Gridmanager, so any issues with the CE/local batch system interaction will appear in the [GridmanagerLog](#gridmanagerlog). Look for `gm state change…` lines to figure out where the issures are occuring.\n+\n+**Next actions**\n+\n+1. **If you see failures in the GridmanagerLog during job submission:** Save the submit files by adding the appropriate entry to [blah.config](#blahp-configuration-file) and submit it [manually](#idle-jobs-on-ce-make-sure-the-underlying-batch-system-can-run-jobs) to the batch system. If that succeeds, make sure that the BLAHP knows where your binaries are located by setting the `<batch system>_binpath` in `/etc/blah.config`.\n+2. **If you see failures in the GridmanagerLog during queries for job status:** Query the resultant job with your batch system tools from the CE. If you can, the BLAHP uses scripts to query for status in `/usr/libexec/blahp/<batch system>_status.sh` (e.g., `/usr/libexec/blahp/lsf_status.sh`) that take the argument `batch system/YYYMMDD/job ID` (e.g., `lsf/20141008/65053`). Run the appropriate status script for your batch system and upon success, you should see the following output:\n+\n+        :::console\n+        root@host # /usr/libexec/blahp/lsf_status.sh lsf/20141008/65053\n+        [ BatchjobId = \"894862\"; JobStatus = 4; ExitCode = 0; WorkerNode = \"atl-prod08\" ]\n+\n+    If the script fails, [request help](#getting-help) from the OSG.\n+\n+\n+#### Idle jobs on CE: Make sure the underlying batch system can run jobs\n+\n+HTCondor-CE communicates directly with an HTCondor batch system schedd, so if jobs are not running, examine the [SchedLog](#schedlog) and diagnose the problem from there. For other batch systems, the BLAHP is used to submit jobs using your batch system’s job submission binaries, whose location is specified in `/etc/blah.config`.\n+\n+**Procedure**\n+\n+1.  Manually create and submit a simple job (e.g., one that runs `sleep`)\n+2.  Check for errors in the submission itself\n+3.  Watch the job in the batch system queue (e.g., using `condor_q`)\n+4.  If the job does not run, check for errors on the batch system\n+\n+**Next actions**\n+\n+If the underlying batch system does not run a simple manual job, it will probably not run a job coming from HTCondor-CE. Once you can run simple manual jobs on your batch system, try submitting to the HTCondor-CE again.\n+\n+#### Idle jobs on CE: Verify ability to change permissions on key files\n+\n+HTCondor-CE needs the ability to write and chown files in its `spool` directory and if it cannot, jobs will not run at all. Spool permission errors can appear in the [SchedLog](#schedlog) and the [JobRouterLog](#jobrouterlog).\n+\n+**Symptoms**\n+\n+```\n+09/17/14 14:45:42 Error: Unable to chown '/var/lib/condor-ce/spool/1/0/cluster1.proc0.subproc0/env' from 12345 to 54321\n+```\n+\n+**Next actions**\n+\n+- As root, try to change ownership of the file or directory in question. If the file does not exist, a parent directory may have improper permissions.\n+- Verify that there aren't any underlying file system issues in the specified location\n+\n+### Jobs stay idle on a remote host submitting to the CE\n+\n+If you are submitting your job from a separate submit host to the CE, it stays idle in the queue forever, and you do not see a resultant job in the CE's queue, this means that your job cannot contact the CE for submission or it is not authorized to run there. Note that jobs may take several minutes or longer if the CE is busy.\n+\n+#### Remote idle jobs: Can you contact the CE?\n+\n+To check basic connectivity to a CE, use [condor\\_ce\\_ping](#condor95ce95ping):\n+\n+**Symptoms**\n+\n+``` console\n+user@host $ condor_ping -verbose -name condorce.example.com -pool condorce.example.com:9619 WRITE\n+ERROR: couldn't locate condorce.example.com!\n+```\n+\n+**Next actions**\n+\n+1.  Make sure that the HTCondor-CE daemons are running with [condor\\_ce\\_status](#condor95ce95status).\n+2.  Verify that your CE is reachable from your submit host, replacing `condorce.example.com` with the hostname of your CE:\n+\n+        :::console\n+        user@host $ ping condorce.example.com\n+\n+#### Remote idle jobs: Are you authorized to run jobs on the CE?\n+\n+The CE will only accept jobs from users that authenticate via LCMAPS, grid mapfile, or GUMS. You can use [condor\\_ce\\_ping](#condor95ce95ping) to check if you are authorized and what user your proxy is being mapped to.\n+\n+**Symptoms**\n+\n+``` console\n+user@host $ condor_ping -verbose -name condorce.example.com -pool condorce.example.com:9619 WRITE\n+Remote Version:              $CondorVersion: 8.0.7 Sep 24 2014 $\n+Local  Version:              $CondorVersion: 8.0.7 Sep 24 2014 $\n+Session ID:                  condorce:3343:1412790611:0\n+Instruction:                 WRITE\n+Command:                     60021\n+Encryption:                  none\n+Integrity:                   MD5\n+Authenticated using:         GSI\n+All authentication methods:  GSI\n+Remote Mapping:              gsi@unmapped\n+Authorized:                  FALSE\n+```\n+\n+Notice the failures in the above message: `Remote Mapping: gsi@unmapped` and `Authorized: FALSE`\n+\n+**Next actions**\n+\n+1.  Verify that an [authentication method](install-htcondor-ce#configuring-authentication) is set up on the CE\n+2.  Verify that your user DN is mapped to an existing system user\n+\n+### Jobs go on hold\n+\n+Jobs will be put on held with a `HoldReason` attribute that can be inspected with [condor\\_ce\\_q](#condor95ce95q):\n+\n+``` console\n+user@host $ condor_ce_q -l <JOB-ID> -attr HoldReason\n+HoldReason = \"CE job in status 5 put on hold by SYSTEM_PERIODIC_HOLD due to non-existent route or entry in JOB_ROUTER_ENTRIES.\"\n+```\n+\n+#### Held jobs: Missing/expired user proxy\n+\n+HTCondor-CE requires a valid user proxy for each job that is submitted. You can check the status of your proxy with the following\n+\n+``` console\n+user@host $ voms-proxy-info -all\n+```\n+\n+**Next actions**\n+\n+Ensure that the owner of the job generates their proxy with `voms-proxy-init`.\n+\n+#### Held jobs: Invalid job universe\n+\n+The HTCondor-CE only accepts jobs that have `universe` in their submit files set to `vanilla`, `standard`, `local`, or `scheduler`. These universes also have corresponding integer values that can be found in the [HTCondor manual](http://research.cs.wisc.edu/htcondor/manual/v8.6/12_Appendix_A.html#91174).\n+\n+**Next actions**\n+\n+1.  Ensure jobs submitted locally, from the CE host, are submitted with `universe = vanilla`\n+2.  Ensure jobs submitted from a remote submit point are submitted with:\n+\n+        universe = grid\n+        grid_resource = condor condorce.example.com condorce.example.com:9619\n+\n+    replacing `condorce.example.com` with the hostname of the CE.\n+\n+#### Held jobs: Non-existent route or entry in JOB\\_ROUTER\\_ENTRIES\n+\n+Jobs on the CE will be put on hold if they do not match any job routes within 30 minutes.\n+\n+**Next actions**\n+\n+Use [condor\\_ce\\_job\\_router\\_info](#condor95ce95job95router95info) to see why your idle job does not match any routes.\n+\n+\n+### Identifying the corresponding job ID on the local batch system\n+\n+When troubleshooting interactions between your CE and your local batch system, you will need to associate the CE job ID and the resultant job ID on the batch system. The methods for finding the resultant job ID differs between batch systems.\n+\n+#### HTCondor batch systems\n+\n+1.  To inspect the CE’s job ad, use [condor\\_ce\\_q](#condor95ce95q) or [condor\\_ce\\_history](#condor95ce95history):\n+\n+    - Use `condor_ce_q` if the job is still in the CE’s queue:\n+\n+            :::console\n+            user@host $ condor_ce_q <JOB-ID> -af RoutedToJobId\n+\n+    - Use `condor_ce_history` if the job has left the CE’s queue:\n+\n+            :::console\n+            user@host $ condor_ce_history <JOB-ID> -af RoutedToJobId\n+\n+2.  Parse the [JobRouterLog](#jobrouterlog) for the CE’s job ID.\n+\n+#### Non-HTCondor batch systems\n+\n+When HTCondor-CE records the corresponding batch system job ID, it is written in the form `<BATCH-SYSTEM>/<DATE>/<JOB ID>`:\n+\n+```\n+lsf/20141206/482046\n+```\n+\n+1.  To inspect the CE’s job ad, use [condor\\_ce\\_q](#condor95ce95q):\n+\n+        :::console\n+        user@host $ condor_ce_q <JOB-ID> -af GridJobId\n+\n+2.  Parse the [GridmanagerLog](#gridmanagerlog) for the CE’s job ID.\n+\n+### Jobs removed from the local HTCondor pool become resubmitted (HTCondor batch systems only)\n+\n+By design, HTCondor-CE will resubmit jobs that have been removed from the underlying HTCondor pool. Therefore, to remove misbehaving jobs, they will need to be removed on the CE level following these steps:\n+\n+1.  Identify the misbehaving job ID in your batch system queue\n+2.  Find the job's corresponding CE job ID:\n+\n+        :::console\n+        user@host $ condor_q <JOB-ID> -af RoutedFromJobId\n+\n+3.  Use `condor_ce_rm` to remove the CE job from the queue\n+\n+### Missing HTCondor tools\n+\n+Most of the HTCondor-CE tools are just wrappers around existing HTCondor tools that load the CE-specific config. If you are trying to use HTCondor-CE tools and you see the following error:\n+\n+``` console\n+user@host $ condor_ce_job_router_info\n+/usr/bin/condor_ce_job_router_info: line 6: exec: condor_job_router_info: not found\n+```\n+\n+This means that the `condor_job_router_info` (note this is not the CE version), is not in your `PATH`.\n+\n+**Next Actions**\n+\n+1.  Either the condor RPM is missing or there are some other issues with it (try `rpm --verify condor`).\n+2.  You have installed HTCondor in a non-standard location that is not in your `PATH`.\n+3.  The `condor_job_router_info` tool itself wasn't available until Condor-8.2.3-1.1 (available in osg-upcoming).\n+\n+HTCondor-CE Troubleshooting Tools\n+---------------------------------\n+\n+HTCondor-CE has its own separate set of of the HTCondor tools with **ce** in the name (i.e., `condor_ce_submit` vs `condor_submit`). Some of the the commands are only for the CE (e.g., `condor_ce_run` and `condor_ce_trace`) but many of them are just HTCondor commands configured to interact with the CE (e.g., `condor_ce_q`, `condor_ce_status`). It is important to differentiate the two: `condor_ce_config_val` will provide configuration values for your HTCondor-CE while `condor_config_val` will provide configuration values for your HTCondor batch system. If you are not running an HTCondor batch system, the non-CE commands will return errors.\n+\n+### condor\\_ce\\_trace\n+\n+#### Usage\n+\n+`condor_ce_trace` is a useful tool for testing end-to-end job submission. It contacts both the CE’s Schedd and Collector daemons to verify your permission to submit to the CE, displays the submit script that it submits to the CE, and tracks the resultant job.\n+\n+!!! note\n+    You must have generated a proxy (e.g., `voms-proxy-init`) and your DN must be added to your [chosen authentication method](install-htcondor-ce#configuring-authentication).\n+\n+``` console\n+user@host $ condor_ce_trace condorce.example.com\n+```\n+\n+Replacing the `condorce.example.com` with the hostname of the CE. If you are familiar with the output of condor commands, the command also takes a `--debug` option that displays verbose condor output.\n+\n+#### Troubleshooting\n+\n+1.  **If the command fails with “Failed ping…”:** Make sure that the HTCondor-CE daemons are running on the CE\n+2.  **If you see “gsi@unmapped” in the “Remote Mapping” line:** Either your credentials are not mapped on the CE or authentication is not set up at all. To set up authentication, refer to our [installation document](install-htcondor-ce#configuring-authentication).\n+3.  **If the job submits but does not complete:** Look at the status of the job and perform the relevant [troubleshooting steps](#htcondor-ce-troubleshooting-items).\n+\n+### condor\\_ce\\_run\n+\n+#### Usage\n+\n+Similar to `globus-job-run`, `condor_ce_run` is a tool that submits a simple job to your CE, so it is useful for quickly submitting jobs through your CE. To submit a job to the CE and run the `env` command on the remote batch system:\n+\n+!!! note\n+    You must have generated a proxy (e.g., `voms-proxy-init`) and your DN must be added to your [chosen authentication method](install-htcondor-ce#configuring-authentication).\n+\n+``` console\n+user@host $ condor_ce_run -r condorce.example.com:9619 /bin/env\n+```\n+\n+Replacing the `condorce.example.com` with the hostname of the CE. If you are troubleshooting an HTCondor-CE that you do not have a login for and the CE accepts local universe jobs, you can run commands locally on the CE with `condor_ce_run` with the `-l` option. The following example outputs the JobRouterLog of the CE in question:\n+\n+``` console\n+user@host $ condor_ce_run -lr condorce.example.com:9619 cat /var/log/condor-ce/JobRouterLog\n+```\n+\n+Replacing the `condorce.example.com` text with the hostname of the CE. To disable this feature on your CE, consult [this](install-htcondor-ce#limiting-or-disabling-locally-running-jobs-on-the-ce) section of the install documentation.\n+\n+#### Troubleshooting\n+\n+1.  **If you do not see any results:** `condor_ce_run` does not display results until the job completes on the CE, which may take several minutes or longer if the CE is busy. In the meantime, can use [condor\\_ce\\_q](#condor95ce95q) in a separate terminal to track the job on the CE. If you never see any results, use [condor\\_ce\\_trace](#condor95ce95trace) to pinpoint errors.\n+2.  **If you see an error message that begins with “Failed to…”:** Check connectivity to the CE with [condor\\_ce\\_trace](#condor95ce95trace) or [condor\\_ce\\_ping](#condor95ce95ping)\n+\n+### condor\\_\\ce_submit\n+\n+See the [submitting to HTCondor-CE](submit-htcondor-ce) document for details.\n+\n+### condor\\_ce\\_ping", 
  "html_url": "https://github.com/opensciencegrid/docs/pull/177#discussion_r139839519", 
  "id": 139839519, 
  "original_commit_id": "ac978ed6174bc950889cb298da6f088ecee66615", 
  "original_position": 408, 
  "path": "docs/compute-element/troubleshoot-htcondor-ce.md", 
  "position": null, 
  "pull_request_review_id": 63827380, 
  "pull_request_url": "https://api.github.com/repos/opensciencegrid/docs/pulls/177", 
  "updated_at": "2017-09-28T00:14:43Z", 
  "url": "https://api.github.com/repos/opensciencegrid/docs/pulls/comments/139839519", 
  "user": {
    "avatar_url": "https://avatars0.githubusercontent.com/u/5246893?v=4", 
    "events_url": "https://api.github.com/users/matyasselmeci/events{/privacy}", 
    "followers_url": "https://api.github.com/users/matyasselmeci/followers", 
    "following_url": "https://api.github.com/users/matyasselmeci/following{/other_user}", 
    "gists_url": "https://api.github.com/users/matyasselmeci/gists{/gist_id}", 
    "gravatar_id": "", 
    "html_url": "https://github.com/matyasselmeci", 
    "id": 5246893, 
    "login": "matyasselmeci", 
    "organizations_url": "https://api.github.com/users/matyasselmeci/orgs", 
    "received_events_url": "https://api.github.com/users/matyasselmeci/received_events", 
    "repos_url": "https://api.github.com/users/matyasselmeci/repos", 
    "site_admin": false, 
    "starred_url": "https://api.github.com/users/matyasselmeci/starred{/owner}{/repo}", 
    "subscriptions_url": "https://api.github.com/users/matyasselmeci/subscriptions", 
    "type": "User", 
    "url": "https://api.github.com/users/matyasselmeci"
  }
}
