{
  "_links": {
    "html": {
      "href": "https://github.com/opensciencegrid/docs/pull/241#discussion_r149814182"
    }, 
    "pull_request": {
      "href": "https://api.github.com/repos/opensciencegrid/docs/pulls/241"
    }, 
    "self": {
      "href": "https://api.github.com/repos/opensciencegrid/docs/pulls/comments/149814182"
    }
  }, 
  "author_association": "OWNER", 
  "body": "Is this something that is not guaranteed to work/not supported/not tested? If so, I think we could use a stronger warning", 
  "commit_id": "07df5de9d9b93d575a9ae706390bc823517d0094", 
  "created_at": "2017-11-08T22:18:58Z", 
  "diff_hunk": "@@ -1,50 +1,52 @@\n-Procedures for handling OASIS externally-hosted CVMFS repositories\n-==================================================================\n-\n-**Technical information contained here is believed to be reliable but administrative procedures, particularly as concerns organizational entities outside the OSG, should be considered unapproved proposals.**\n-\n+Setting up a Software Repository\n+================================\n \n About OASIS\n -----------\n \n-OASIS is the OSG Application Software Installation Service. It is the recommended method to install software on the Open Science Grid. It is implemented using CernVM FileSystem (CVMFS) technology.\n+OASIS (the **OSG** **A**pplication **S**oftware **I**nstallation **S**ervice) is an infrastructure, based on\n+[CVMFS](https://cvmfs.readthedocs.io), for distributing software throughout the OSG.  Once software is installed into\n+an OASIS repository, it should be available across about 90% of the OSG within an hour or two.\n \n-About this Document\n--------------------\n+OASIS consists of keysigning infrastructure, a content distribution network (CDN), and a shared CVMFS repository that\n+is hosted by the OSG.  Many use cases will be covered by utilizing the [shared repository](update-oasis); this documen\n+covers how to setup and host your own CVMFS _repository server_.  This server will  distribute softwarevia OASIS, but\n+be hosted and operated externally from the OSG project.\n \n-This document describes the detailed procedures for dealing with CVMFS repositories that are part of the OASIS system but are not hosted at the OSG Global Operations Center (GOC). Rather, they are hosted at the home institution of a Virtual Organization (VO). The procedures include the steps performed by both the GOC and by the repository service administrator. If you are only interested in using an OASIS repository that is hosted at the GOC, see [this document](update-oasis) instead.\n+OASIS-based distribution and key signing is available to OSG VOs or repositories affiliated with an OSG VO.\n+See the [policy page](https://opensciencegrid.github.io/technology/policy/external-oasis-repos/) for more information\n+on what repositories OSG is willing to distribute.\n \n-Policies\n---------\n+Before Starting\n+---------------\n \n-These are the policies regarding OSG CVMFS repositories:\n+CVMFS repositories work at the kernel filesystem layer, which adds more stringent host requirements than a typical\n+OSG install.  The host OS must meet ONE of the following:\n \n-1.  The GOC will not host VO-specific CVMFS repositories. This means it will not use its machines to publish files to a repository that is dedicated to a VO. The GOC hosts one and only one repository and that is oasis.opensciencegrid.org.\n-2.  The GOC will replicate an external repository of a VO or provide access to use oasis.opensciencegrid.org per the existing mechanisms but not both for a given VO.\n-3.  Quotas on size of repos may be implemented at the discretion of the GOC. A minimum of 100 GB per VO/repo is guaranteed, larger limits may be requested.\n-4.  The fully qualified repository names of CVMFS repositories distributed to the OSG may be in any domain, but only those in the opensciencegrid.org domain may be requested to be exported to the European grid EGI at this time. There must be one secured master key for all the repositories in a domain. (Although note that the OSG OASIS servers replace that key with their own when distributing non-opensciencegrid.org repositories to OSG sites.)\n+-   RHEL 7.3 (or equivalent) or later.  **This option is recommended**.\n+-   RHEL 6 with the aufs kernel module.\n \n-Requirements: setting up a CVMFS repository server\n---------------------------------------------------\n+Additionally,\n \n-This document doesn't cover requirements for the GOC computers since those are already set up. The requirements for a CVMFS repository server are that it have installed cvmfs-server and cvmfs client, both version 2.2.2 or greater; version 2.3.3 or greater is recommended on EL6 and required on EL7. This requires using aufs or OverlayFS: aufs requires a modified kernel from CERN for Redhat EL6-based systems, and OverlayFS requires at least EL7.3; the latter uses a standard kernel so it is highly recommended. Also an apache httpd server needs to be enabled. NOTE: multiple cvmfs repositories can be hosted on the same machine.\n+-   **User IDs:** If it does not exist already, the installation will create the `cvmfs` Linux user\n+-   **Group IDs:** If they do not exist already, the installation will create the Linux groups `cvmfs` and `fuse`\n+-   **Network ports:** This page will configure the repository to distribute using Apache HTTPD on port 8000.  At the\n+    minimum, the repository needs in-bound access from the OASIS CDN.\n+-   **Disk space:** This host will need enough free disk space to host _two_ copies of the software: one compressed\n+    and one uncompressed. `/srv/cvmfs` will hold all the published data, while `/var/spool/cvmfs` will contain all\n+    the data in the current transaction.\n+-   **Root access** will be needed to install.  Software install will be done as an unprivileged user.\n+-   **Yum** will need to be [configured to use the OSG repositories](../common/yum).\n \n-`/srv/cvmfs` will hold all the published data, so make sure it is large enough to hold all the repositories hosted on the machine. `/var/spool/cvmfs` will hold files during publish, so it should be large enough to hold the most amount of data that might be attempted to be published at once. In addition, on EL7 and cvmfs-server-2.4.1, `/var/spool/cvmfs` needs to be of filesystem type 'ext3' or 'ext4', or the `cvmfs_server` command will not allow it. There is a variable to override the filesystem type check, but other filesystem types are not guaranteed to work (xfs created with `ftype=1` should work with `CVMFS_DONT_CHECK_OVERLAYFS_VERSION=yes`).\n+!!! warning\n+    RHEL7 only supports Overlay-FS if the underlying filesystem is `ext3` or `ext4`; make sure `/var/spool/cvmfs`\n+    is one of these filesystem types.\n \n-As with all OSG software installations, there are some one-time (per host) steps to prepare in advance:\n+    If this is not possible, add `CVMFS_DONT_CHECK_OVERLAYFS_VERSION=yes` to your CVMFS configuration.  It is believed", 
  "html_url": "https://github.com/opensciencegrid/docs/pull/241#discussion_r149814182", 
  "id": 149814182, 
  "original_commit_id": "8fff3ebca223dbe12429bedb19646b78fbd7937d", 
  "original_position": 66, 
  "path": "docs/data/external-oasis-repos.md", 
  "position": null, 
  "pull_request_review_id": 75267776, 
  "pull_request_url": "https://api.github.com/repos/opensciencegrid/docs/pulls/241", 
  "updated_at": "2017-11-10T13:51:48Z", 
  "url": "https://api.github.com/repos/opensciencegrid/docs/pulls/comments/149814182", 
  "user": {
    "avatar_url": "https://avatars3.githubusercontent.com/u/390105?v=4", 
    "events_url": "https://api.github.com/users/brianhlin/events{/privacy}", 
    "followers_url": "https://api.github.com/users/brianhlin/followers", 
    "following_url": "https://api.github.com/users/brianhlin/following{/other_user}", 
    "gists_url": "https://api.github.com/users/brianhlin/gists{/gist_id}", 
    "gravatar_id": "", 
    "html_url": "https://github.com/brianhlin", 
    "id": 390105, 
    "login": "brianhlin", 
    "organizations_url": "https://api.github.com/users/brianhlin/orgs", 
    "received_events_url": "https://api.github.com/users/brianhlin/received_events", 
    "repos_url": "https://api.github.com/users/brianhlin/repos", 
    "site_admin": false, 
    "starred_url": "https://api.github.com/users/brianhlin/starred{/owner}{/repo}", 
    "subscriptions_url": "https://api.github.com/users/brianhlin/subscriptions", 
    "type": "User", 
    "url": "https://api.github.com/users/brianhlin"
  }
}
