{
  "_links": {
    "html": {
      "href": "https://github.com/opensciencegrid/docs/pull/241#discussion_r150108408"
    }, 
    "pull_request": {
      "href": "https://api.github.com/repos/opensciencegrid/docs/pulls/241"
    }, 
    "self": {
      "href": "https://api.github.com/repos/opensciencegrid/docs/pulls/comments/150108408"
    }
  }, 
  "author_association": "MEMBER", 
  "body": "Steps 3, 4, 5, and 6 could be labeled as OSG internal.", 
  "commit_id": "07df5de9d9b93d575a9ae706390bc823517d0094", 
  "created_at": "2017-11-09T22:39:18Z", 
  "diff_hunk": "@@ -63,94 +82,171 @@ root@host # chkconfig httpd on\n root@host # service httpd start\n ```\n \n-Make sure that port 8000 is available to the internet through any firewalls.\n+!!! note\n+    Make sure that port 8000 is available to the Internet.  Check the setting of the host- and site-level firewalls.\n+    The next steps will fail if the web server is not accessible.\n+\n+Create a Repository\n+-------------------\n \n-Procedure to add an externally-hosted repository to OASIS\n----------------------------------------------------------\n+Prior to creation, the repository administrator will need to make two decisions:\n \n-1.  A VO representative who will have responsibility for the contents of the repository chooses a name for the repository. This name should be the name of the VO or be derived from it (or a project in the VO for the case of the OSG VO), and in a domain that has a secured master key. The recommended domain name for a new repository that originates at an OSG site is opensciencegrid.org. The full name used as an example in this document is **repo.domain.name**. Note: the VO representative's name will be registered in OIM as an OASIS manager for the VO, and names can be added or changed later with GOC tickets. If there is more than one repository for the VO, all the OASIS managers are assumed to be contacts for all the repositories.\n+-   **Select a repository name**; typically, this is derived from the VO or project's name and ends in\n+    `opensciencegrid.org`.  For example, the NoVA VO runs the repository `nova.opensciencegrid.org`.  For this section,\n+    we will use %RED%example.opensciencegrid.org%ENDCOLOR%.\n+-   **Select a repository owner**: Software publication will need to run by a non-`root` Unix user account; for this\n+    document, we will use %BLUE%LIBRARIAN%ENDCOLOR% as the account name of the repository owner.\n \n-2.  Using whatever mechanism is appropriate at their institution, the VO representative requests the local CVMFS repository service administrator to create this repository called `repo.domain.name`.\n+The initial repository creation must be run as `root`:\n \n-3.  The repository service administrator creates the repository with these command like these, where ownerid is the user id that will have write access:\n+    :::console\n+    root@host # echo -e \"\\*\\\\t\\\\t-\\\\tnofile\\\\t\\\\t16384\" >>/etc/security/limits.conf\n+    root@host # ulimit -n 16384\n+    root@host # cvmfs_server mkfs -o %BLUE%LIBRARIAN%ENDCOLOR% %RED%example.opensciencegrid.org%ENDCOLOR%\n+    root@host # echo \"CVMFS_AUTO_TAG=false\" >>/etc/cvmfs/repositories.d/%RED%example.opensciencegrid.org%ENDCOLOR%/server.conf\n+    root@host # (echo Order deny,allow;echo Deny from all;echo Allow from 127.0.0.1;echo Allow from ::1;echo Allow from 129.79.53.0/24;echo Allow from 2001:18e8:2:6::/56) >/srv/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%/.htaccess\n \n-        :::console\n-        root@host # echo -e \"\\*\\\\t\\\\t-\\\\tnofile\\\\t\\\\t16384\" >>/etc/security/limits.conf \n-        root@host # ulimit -n 16384 \n-        root@host # cvmfs_server mkfs -o ownerid repo.domain.name \n-        root@host # echo \"CVMFS_AUTO_TAG=false\" >>/etc/cvmfs/repositories.d/repo.domain.name/server.conf \n-        root@host # (echo Order deny,allow;echo Deny from all;echo Allow from 127.0.0.1;echo Allow from ::1;echo Allow from 129.79.53.0/24;echo Allow from 2001:18e8:2:6::/56) >/srv/cvmfs/repo.domain.name/.htaccess\n+Here, we increase the number of open files, create the repository using the `mkfs` command, adjust the configuration,\n+and then limit the hosts that are allowed to access the repo to the OSG CDN.\n \n-    If you might be hosting any hardlinks that span directories (e.g. the git package) and are using aufs (that is, EL6), also do the following:\n+!!! note\n+    If you might be hosting any hardlinks that span directories (e.g. publishing a `git` repository) and are using\n+    EL6 with aufs, make the following configuration change:\n \n         :::console\n         root@host # echo \"CVMFS_IGNORE_XDIR_HARDLINKS=true\" >>/etc/cvmfs/repositories.d/repo.domain.name/server.conf\n \n-    Verify that the repository is readable over http with the following command:\n+Verify that the repository is readable over HTTP:\n \n-        :::console\n-        root@host # wget -qO- http://localhost:8000/cvmfs/repo.domain.name/.cvmfswhitelist|cat -v\n+    :::console\n+    root@host # wget -qO- http://localhost:8000/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%/.cvmfswhitelist | cat -v\n \n-    That should print several lines including some gibberish at the end.\n+That should print several lines including some gibberish at the end.\n \n-4.  The repository service administrator next creates a [GOC ticket](https://ticket.opensciencegrid.org/goc/submit) using the following format:\n+Host a Repository on OASIS\n+------------------------\n \n-        Please add a new CVMFS repository to OASIS for VO voname using the URL \n-            http://fully.qualified.domain:8000/cvmfs/repo.domain.name \n-        by doing step #5 at\n-            https://opensciencegrid.github.io/docs/data/external-oasis-repos\n-        The VO responsible manager will be Vorep Name.\n+1.  **Verify your VO's OIM registration is up-to-date**.  All repositories need to be associated with a VO; the VO\n+    needs to assign an _OASIS manager_ in OIM who would be responsible for the contents of any of the VO's repositories\n+    and will be contacted in case of issues. To designate an OASIS manager, have the VO manager update the\n+    [OIM registration](https://oim.grid.iu.edu).\n \n-    replacing \"voname\" with the VO's name, \"fully.qualified.domain\" with the full name of the repository server, \"repo.domain.name\" with the full name of the repository, and \"Vorep Name\" with the name of the VO representative.\n+2.  The repository administrator should **create a [support ticket](https://ticket.opensciencegrid.org/goc/submit)**\n+    using the following template:\n \n-5.  The GOC representative next ensures that the repository service administrator is a valid representative of a host site for the VO. This can be done by (a) the GOC representative already having a relationship with the person or (b) the GOC representative contacting the VO manager to find out. The GOC representative makes sure that the repo.domain.name in the URL is derived from the VO name. \n+        Please add a new CVMFS repository to OASIS for VO %RED%voname%ENDCOLOR% using the URL \n+            http://%RED%fully.qualified.domain%ENDCOLOR%:8000/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%\n+        by doing step #3 at\n+            https://opensciencegrid.github.io/docs/data/external-oasis-repos\n+        The VO responsible manager will be %RED%OASIS Manager Name%ENDCOLOR%.\n \n-6.  The GOC representative then adds the URL in OIM under OASIS Repo URLs for the VO. The repository will then be added to the GOC stratum 0 within 15 minutes.  Within an hour after step 8 is completed, the repository should also be automatically added to the GOC and FNAL stratum 1s.\n+    Replace the %RED%red%ENDCOLOR% items with the appropriate values.\n \n-7.  If domain.name is a new domain that has not been distributed before, the GOC representative next places a copy of the domain.name.pub public key from domain.name into /srv/etc/keys on both oasis-replica and oasis-replica-itb. If the GOC representative does not have that key, he or she can ask the repository service representative in the ticket how to get it. In addition, in order to support cvmfs client versions 2.2.X (both older and newer clients do not need it), a symbolic link of `domain.name`.conf has to be made in /cvmfs/config-osg.opensciencegrid.org/etc/cvmfs/domain.d pointing to default.conf. This symbolic link has to be created on the oasis-itb machine's copy of the config-osg.opensciencegrid.org repository and then copied to production with the `copy_config_osg` command on the oasis machine.\n+3.  (**OSG internal step**)\n+    OSG Operations ensures that the repository administrator is valid for the VO. This can be done by (a) OSG\n+    already having a relationship with the person or (b) the GOC representative contacting the VO manager to find out.\n+    OSG Operations should review the URL to verify it is appropriate for the VO.  This typically takes one business day.\n \n-8.  If the repository name matches `*.opensciencegrid.org` or `*.osgstorage.org`, the GOC representative responds in the ticket to ask that step \\#8 be done; all other repositories (such as `*.egi.eu`) skip this step. The repository service administrator next executes the following commands (replacing repo.opensciencegrid.org with repo.osgstorage.org when needed):\n+4.  (**OSG internal step**)\n+    The OSG representative adds the repository URL in OIM under the VO's OASIS repository URLs. This should cause\n+    the repository's configuration to be added to the GOC Stratum-0 within 15 minutes.  Within an hour step 8 is\n+    completed, the repository should also be automatically added to the GOC and FNAL stratum 1s.\n \n-        :::console\n-        root@host # wget -O /srv/cvmfs/repo.opensciencegrid.org/.cvmfswhitelist http://oasis.opensciencegrid.org/cvmfs/repo.opensciencegrid.org/.cvmfswhitelist \n-        root@host # /bin/cp /etc/cvmfs/keys/opensciencegrid.org/opensciencegrid.org.pub /etc/cvmfs/keys/repo.opensciencegrid.org.pub\n+5.  (**OSG internal step**): If the respository ends in a new\n+    domain name that has not been distributed before, the OSG representative next places a copy of the `domain.name.pub`\n+    public key from `domain.name` into `/srv/etc/keys` on both `oasis-replica` and `oasis-replica-itb`. If the OSG\n+    representative does not have that key, he or she will ask the repository service representative how to obtain it.\n+    In order to support CVMFS client versions 2.2.X, a symbolic link of `domain.name.conf` has to be made in\n+    `/cvmfs/config-osg.opensciencegrid.org/etc/cvmfs/domain.d` pointing to `default.conf`. This symbolic link has to be\n+    created on the `oasis-itb` machine's copy of the `config-osg.opensciencegrid.org` repository and then copied to\n+    production with the `copy_config_osg` command on the oasis machine.\n \n-    Next the administrator verifies that a publish operation using the owner's privileges succeeds by making sure there's no errors from the following commands replacing \"ownerid\" with the owner's username:\n+6.  If the repository name matches `*.opensciencegrid.org` or `*.osgstorage.org`, the OSG representative responds in\n+    the ticket to ask that step \\#6 be done; all other repositories (such as `*.egi.eu`) skip this step.\n \n-        :::console\n-        root@host # su ownerid -c \"cvmfs_server transaction repo.opensciencegrid.org\" \n-        root@host # su ownerid -c \"cvmfs_server publish repo.opensciencegrid.org\"\n+    The repository administrator should **execute the following commands**:\n \n-    If that works then add the wget command to a daily cron:\n-        \n         :::console\n-        root@host # echo \"5 4 \\* \\* \\* ownerid cd /srv/cvmfs/repo.opensciencegrid.org && wget -qO .cvmfswhitelist.new http://oasis.opensciencegrid.org/cvmfs/repo.opensciencegrid.org/.cvmfswhitelist && mv .cvmfswhitelist.new .cvmfswhitelist\" >>/etc/cron.d/fetch-cvmfs-whitelist\n-\n-    Note that this eliminates the need for the repository service administrator to periodically use `cvmfs_server resign` to update `.cvmfswhitelist`. Then the repository service administrator goes back to the open GOC ticket and asks to proceed to step \\#9.\n-\n-9.  The GOC representative then asks the administrator of the BNL stratum 1 to also add the new repository. He should set up his stratum 1s to read from `http://oasis-replica.opensciencegrid.org:8000/cvmfs/repo.domain.name`. When he has reported back that the replication is ready, the GOC representative reports in the ticket that the repository is ready on the OSG and closes the ticket.\n+        root@host # wget -O /srv/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%/.cvmfswhitelist \\\n+                    http://oasis.opensciencegrid.org/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%/.cvmfswhitelist \n+        root@host # /bin/cp /etc/cvmfs/keys/opensciencegrid.org/opensciencegrid.org.pub \\\n+                    /etc/cvmfs/keys/%RED%example.opensciencegrid.org%ENDCOLOR%.pub\n \n-10.  The repository service administrator then gives the VO representative access to the repository under the \"ownerid\" login, informs them of the [CVMFS documentation on maintaining repositories](http://cernvm.cern.ch/portal/filesystem/maintain-repositories) and requests that they adhere to the [CVMFS documentation on repository content limitations](http://cernvm.cern.ch/portal/filesystem/repository-limits). If the domain.name is opensciencegrid.org, the repository service administrator should also inform the VO representative that if they want the repository to be accessed outside of the U.S. they should open a ggus ticket following the EGI's [PROC20](https://wiki.egi.eu/wiki/PROC2\\). (Note: EGI does not have a concept of sub-VOs like OSG does; to EGI, all sub-VOs under fermilab are the fermilab VO).\n+    Replace %RED%example.opensciencegrid.org%ENDCOLOR% as appropriate.  Next, the repository administrator should\n+    verify that publishing operation succeed:\n \n-Emergency procedure to blank an externally-hosted repository to OASIS\n----------------------------------------------------------------------\n-\n-1.  If there is an emergency request from OSG security to shut down the distribution of a repository, the GOC representative just needs to run `blank_osg_repository` on oasis-replica and give it the full name of the repository. This will rename the repository directories to a name with the current timestamp and replace it with a blank repository. It includes a step to run on the oasis machine, and attempts to do it with ssh, but if that fails it prints instructions on how to finish by logging in to the oasis machine manually.\n-2.  When it is time to put the repository back into production, the GOC representative runs `unblank_osg_repository` on oasis-replica and gives it the full name of the repository again. This will find the directory with the old timestamp and put it back into service. This step also attempts to ssh to the oasis machine.\n-\n-Procedure to change the URL of an external repository\n------------------------------------------------------\n-\n-1.  The repository service administrator opens a GOC ticket with the value of the new URL.\n-2.  The GOC representative then changes the registered value in OIM for the VO in OASIS Repo URLs. The GOC stratum 1 will then be updated within an hour.\n+        :::console\n+        root@host # su %BLUE%LIBRARIAN%ENDCOLOR% -c \"cvmfs_server transaction %RED%example.opensciencegrid.org%ENDCOLOR%\"\n+        root@host # su %BLUE%LIBRARIAN%ENDCOLOR% -c \"cvmfs_server publish %RED%example.opensciencegrid.org%ENDCOLOR%\"\n \n-Procedure to shut down and remove an external repository\n---------------------------------------------------------\n+    Within an hour, the repository updates should appear at the GOC and FNAL Stratum-1 servers.\n \n-1. First, if the repository has been replicated outside of the U.S., the repository service administrator should open a GGUS ticket asking that the replication be removed from EGI stratum 1s. Wait until they say they are finished before going to the next step. \n-1. Next, the repository service administrator opens a GOC ticket asking to shut down the repository, giving the repository name, for example `repo.domain.name`, and the VO it belongs to. \n-1. After validating that the ticket submitter is authorized by a registered OASIS manager, the GOC representative next deletes the registered value for `repo.domain.name` in OIM for the VO in OASIS Repo URLs. \n-1. Next, the GOC representative adds the FNAL and BNL stratum 1 administrators to the ticket to asks them to remove the repository. \n-1. When the FNAL and BNL stratum 1 administrators say they have finished, the GOC representative then runs `cvmfs_server rmfs -f repo.domain.name` and `rm -r /oasissrv/cvmfs/repo.domain.name` on oasis-replica-itb and oasis-replica. \n-1. Finally, the GOC representative does `rm -r /srv/cvmfs/repo.domain.name` on oasis-itb and oasis.\n+    On success, make sure the whitelist update happens daily by creating `/etc/cron.d/fetch-cvmfs-whitelist` with the\n+    following contents:\n+        \n+        :::\n+        5 4 * * * %BLUE%LIBRARIAN%ENDCOLOR% cd /srv/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR% && wget -qO .cvmfswhitelist.new http://oasis.opensciencegrid.org/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%/.cvmfswhitelist && mv .cvmfswhitelist.new .cvmfswhitelist\n+\n+    !!! note\n+        This cronjob eliminates the need for the repository service administrator to periodically use\n+        `cvmfs_server resign` to update `.cvmfswhitelist` as described in the upstream CVMFS documentation.\n+\n+    The repository administrator should update the open support ticket and ask to proceed to step \\#7.\n+\n+\n+7.  (**OSG internal step**)\n+    The OSG representative then asks the administrator of the BNL stratum 1 to also add the new repository.\n+    The BNL Stratum-1 operator should set the service to read from\n+    `http://oasis-replica.opensciencegrid.org:8000/cvmfs/%RED%example.opensciencegrid.org%ENDCOLOR%`.\n+    When the BNL Stratum-1 operator has reported back that the replication is ready, the OSG representative reports in\n+    the ticket that the repository is fully replicated on the OSG and closes the ticket.\n+\n+Once the repository is fully replicated on the OSG, the VO may proceed in publishing into CVMFS using the\n+%BLUE%LIBRARIAN%ENDCOLOR% account on the repository server.\n+\n+!!! tip\n+    We strongly recommend the repository maintainer read through the upstream documentation on\n+    [maintaining repositories](http://cernvm.cern.ch/portal/filesystem/maintain-repositories) and\n+    [content limitations](http://cernvm.cern.ch/portal/filesystem/repository-limits).\n+\n+If the repository ends in `.opensciencegrid.org`, the VO may ask for it to be replicated outside the US.  The\n+VO should open a GGUS ticket following EGI's [PROC20](https://wiki.egi.eu/wiki/PROC20).\n+\n+Change the URL of an external repository\n+----------------------------------------\n+\n+If necessary, it is possible to change the URL of the repository server; simply have the repository administrator\n+open a support ticket with the new value, and OSG operations will update OIM's OASIS repository URL for the VO.\n+The GOC Stratum-1 will then be updated within an hour.\n+\n+Remove an external repository\n+-----------------------------\n+\n+1.  If the repository has been replicated outside of the U.S., the repository service administrator should open a GGUS\n+    ticket asking that the replication be removed from EGI Stratum-1s. Wait until this ticket is resolved before\n+    proceeding.\n+2.  The repository administrator opens an OSG support ticket asking to shut down the repository, giving the repository\n+    name (e.g., %RED%example.opensciencegrid.org%ENDCOLOR%) and the corresponding VO.\n+3.  After validating the ticket submitter is authorized by the VO's OASIS manager, the OSG representative next deletes", 
  "html_url": "https://github.com/opensciencegrid/docs/pull/241#discussion_r150108408", 
  "id": 150108408, 
  "original_commit_id": "586ae4bcdd49e42829fd220bd4231b7e68a00926", 
  "original_position": 323, 
  "path": "docs/data/external-oasis-repos.md", 
  "position": null, 
  "pull_request_review_id": 75606692, 
  "pull_request_url": "https://api.github.com/repos/opensciencegrid/docs/pulls/241", 
  "updated_at": "2017-11-10T13:51:48Z", 
  "url": "https://api.github.com/repos/opensciencegrid/docs/pulls/comments/150108408", 
  "user": {
    "avatar_url": "https://avatars1.githubusercontent.com/u/2129743?v=4", 
    "events_url": "https://api.github.com/users/DrDaveD/events{/privacy}", 
    "followers_url": "https://api.github.com/users/DrDaveD/followers", 
    "following_url": "https://api.github.com/users/DrDaveD/following{/other_user}", 
    "gists_url": "https://api.github.com/users/DrDaveD/gists{/gist_id}", 
    "gravatar_id": "", 
    "html_url": "https://github.com/DrDaveD", 
    "id": 2129743, 
    "login": "DrDaveD", 
    "organizations_url": "https://api.github.com/users/DrDaveD/orgs", 
    "received_events_url": "https://api.github.com/users/DrDaveD/received_events", 
    "repos_url": "https://api.github.com/users/DrDaveD/repos", 
    "site_admin": false, 
    "starred_url": "https://api.github.com/users/DrDaveD/starred{/owner}{/repo}", 
    "subscriptions_url": "https://api.github.com/users/DrDaveD/subscriptions", 
    "type": "User", 
    "url": "https://api.github.com/users/DrDaveD"
  }
}
